; domain
(define (domain healthcare_facility_1)
    (:requirements :strips :typing)

    (:types
        location - object
        worker_bot helper_bot - robot
        med_unit robot box supply patient - locatable
    )

    (:predicates
        ; location related
        (at ?obj - locatable ?loc - location) ; locatable is at a location
        (linked ?loc1 - location ?loc2 - location) ; two locations are linked (roadmap)

        ; General Robot related
        (bot_is_free ?bot - robot) ; bot is free (not carrying a box or helping a patient)
        
        ; Worker Bot related
        (carrying_box ?bot - worker_bot ?obj - box) ; robot is carrying an object
        ; Helper Bot related
        (helping_patient ?bot - helper_bot ?pat - patient) ; helper bot is helping a patient
        
        ; Box related
        (box_is_empty ?box - box) ; box doesn't contain any supply in
        (box_on_ground ?box - box) ; box is on the ground (not being carried by a bot)

        ; Patient related
        (patient_on_ground ?pat - patient) ; patient is on the ground (not being helped)

        ; Supply related
        (supply_in_box ?sup - supply ?box - box) ; the supply is in the box
        
        ; Goal Oriented
        (needs_supply ?mu - med_unit ?sup - supply) ; medical unit needs a supply
        (needs_patient ?mu - med_unit ?pat - patient) ; medical unit needs a patient so he they can treat them
        (has_supply ?mu - med_unit ?sup - supply) ; medical unit has a supply
        (has_patient ?mu - med_unit ?pat - patient) ; medical unit has a patient
    )
    
    ;;
    ;; Robot (General)
    ;;

    (:action move_bot_alone
        :parameters (?bot - robot ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is free (not carrying a box or helping a patient)
            (bot_is_free ?bot)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
        )
    )

    (:action move_worker_bot_with_box
        :parameters (?bot - worker_bot ?box - box ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is busy carrying the box
            (carrying_box ?bot ?box)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; change location (box)
            (not (at ?box ?from))
            (at ?box ?to)
        )
    )

    (:action move_helper_bot_with_patient
        :parameters (?bot - helper_bot ?pat - patient ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is busy helping the patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; change location (patient)
            (not (at ?pat ?from))
            (at ?pat ?to)
        )
    )

    ;;
    ;; Worker Bots : These are the bots that carry boxes which can be loaded with supplies (1 box per bot, 1 supply per box) 
    ;;

    (:action pick_up_box
        :parameters (?bot - worker_bot ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; bot is not carrying a box yet
            (bot_is_free ?bot)
            ; the box is not being carried by some other bot
            (box_on_ground ?box)    
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?bot ?box)
            (not (box_on_ground ?box))
            ; flag the bot as non-free (it's carrying a box)
            (not (bot_is_free ?bot))
        )
    )


    (:action drop_down_box
        :parameters (?bot - worker_bot ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?bot ?box)
        )
        :effect (and
            ; bot no longer carries the box
            (not (carrying_box ?bot ?box))
            (box_on_ground ?box)
            ; robot is no once again free
            (bot_is_free ?bot)
        )
    )

    (:action fill_box
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?sup ?loc)
            (at ?box ?loc)
            ; the box is not being carried by any bot
            (box_on_ground ?box)
            ; box must be empty
            (box_is_empty ?box)
        )
        :effect (and
            ; fill the box with the supply
            (supply_in_box ?sup ?box)
            (not (box_is_empty ?box))
        )
    )

    (:action deliver_supply
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location ?mu - med_unit)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?box ?loc)
            ; the box was previously dropped down
            (box_on_ground ?box)
            ; the box contains the supply
            (supply_in_box ?sup ?box)
            ; the medical unit needs such supply
            (needs_supply ?mu ?sup)
        )
        :effect (and
            ; empty the box
            (not (supply_in_box ?sup ?box))
            (box_is_empty ?box)
            ; satisfy the medical unit's need and hand over the supply
            (not (needs_supply ?mu ?sup))
            (has_supply ?mu ?sup)
        )
    )

    ;;
    ;; Helper Bots : These are the bots that accompany patients to medical units
    ;;

    (:action pick_up_patient
        :parameters (?bot - helper_bot ?pat - patient ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?pat ?loc)
            ; patient is not being helped by another bot
            (patient_on_ground ?pat)
            ; helper bot is free
            (bot_is_free ?bot)
        )
        :effect (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
            (not (patient_on_ground ?pat))
            ; helper bot is now busy
            (not (bot_is_free ?bot))
        )
    )
    (:action drop_down_patient
        :parameters (?bot - helper_bot ?pat - patient)
        :precondition (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; helper bot no longer accompanies the patient
            (not (helping_patient ?bot ?pat))
            (patient_on_ground ?pat)
            ; helper bot is now free to help other patients
            (bot_is_free ?bot)
        )
    )
    (:action deliver_patient
        :parameters (?bot - helper_bot ?pat - patient ?mu - med_unit ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?pat ?loc)
            ; the patient was previously dropped down
            (patient_on_ground ?pat)
            ; medical unit needs to treat the patient
            (needs_patient ?mu ?pat)
        )
        :effect (and
            ; satisfy the medical unit's need and hand over the patient
            (not (needs_patient ?mu ?pat))
            (has_patient ?mu ?pat)
        )
    )
)

; problem
(define (problem healthcare_facility_1_medium)
    (:domain healthcare_facility_1)

    (:objects
        ;; Locations
        entrance reception diagnostic_lab corridor1 corridor2 central_warehouse
        surgical_block emergency_room cardiology_ward neurology_ward
        - location

        ;; Robots
        wBot1 - worker_bot
        hBot1 - helper_bot

        ;; Boxes
        box1 - box

        ;; Supplies
        scalpel defibrillator anesthetic - supply

        ;; Medical Units
        trauma_unit resuscitation_unit triage_unit
        operation_unit cardiology_unit neurology_unit
        - med_unit

        ;; Patients
        patient1 patient2 - patient
    )

    (:init
        ;; Roadmap connectivity
        (linked entrance reception)
        (linked reception entrance)

        (linked reception emergency_room)
        (linked emergency_room reception)

        (linked emergency_room corridor2)
        (linked corridor2 emergency_room)

        (linked corridor2 diagnostic_lab)
        (linked diagnostic_lab corridor2)

        (linked corridor1 diagnostic_lab)
        (linked diagnostic_lab corridor1)
        
        (linked surgical_block corridor1)
        (linked corridor1 surgical_block)

        (linked corridor1 central_warehouse)
        (linked central_warehouse corridor1)

        (linked reception corridor1)
        (linked corridor1 reception)

        (linked diagnostic_lab neurology_ward)
        (linked neurology_ward diagnostic_lab)

        (linked surgical_block cardiology_ward)
        (linked cardiology_ward surgical_block)

        ;;  [Entrance]——————[Reception]—————————————[Emergency_Room]
        ;;                       |                         |
        ;;                       |                    [Corridor2]
        ;;                       |                         |
        ;; [Central_warehouse]———————[Corridor1]————[Diagnostic_Lab]————[Neurology_Ward]
        ;;                       |
        ;;                [Surgical_Block]
        ;;                       |
        ;;               [Cardiology_Ward]
 
        ;; Medical unit locations

        (at trauma_unit emergency_room)
        (at resuscitation_unit emergency_room)
        (at triage_unit reception)
        (at operation_unit surgical_block)
        (at cardiology_unit cardiology_ward)
        (at neurology_unit neurology_ward)

        ;; Robot initial positions
        (at wBot1 central_warehouse)
        (at hBot1 entrance)

        ;; Robots are at start
        (bot_is_free wBot1)
        (bot_is_free hBot1)

        ;; Boxes
        (at box1 central_warehouse)
        (box_is_empty box1)
        (box_on_ground box1)

        ;; Supplies
        (at scalpel central_warehouse)
        (at defibrillator central_warehouse)
        (at anesthetic central_warehouse)

        ;; Patients
        (at patient1 entrance)
        (at patient2 entrance)
        (patient_on_ground patient1)
        (patient_on_ground patient2)

        ;; Needs
        (needs_supply trauma_unit scalpel)
        (needs_supply resuscitation_unit defibrillator)
        (needs_supply neurology_unit anesthetic)

        (needs_patient operation_unit patient1)
        (needs_patient cardiology_unit patient2)
    )

    (:goal
        (and
            ;; Satisfy all needs
            (has_supply trauma_unit scalpel)
            (has_supply resuscitation_unit defibrillator)
            (has_supply neurology_unit anesthetic)
            (has_patient operation_unit patient1)
            (has_patient cardiology_unit patient2)
        )
    )
)

; plan
1. (fill_box wbot1 box1 anesthetic central_warehouse)
   deleted: (box_is_empty box1)
   added: (supply_in_box anesthetic box1)
   goals met: 0 of 5
2. (pick_up_box wbot1 box1 central_warehouse)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box wbot1 box1)
   goals met: 0 of 5
3. (move_worker_bot_with_box wbot1 box1 central_warehouse corridor1)
   deleted: (at wbot1 central_warehouse) (at box1 central_warehouse)
   added: (at wbot1 corridor1) (at box1 corridor1)
   goals met: 0 of 5
4. (move_worker_bot_with_box wbot1 box1 corridor1 diagnostic_lab)
   deleted: (at wbot1 corridor1) (at box1 corridor1)
   added: (at wbot1 diagnostic_lab) (at box1 diagnostic_lab)
   goals met: 0 of 5
5. (move_worker_bot_with_box wbot1 box1 diagnostic_lab neurology_ward)
   deleted: (at wbot1 diagnostic_lab) (at box1 diagnostic_lab)
   added: (at wbot1 neurology_ward) (at box1 neurology_ward)
   goals met: 0 of 5
6. (drop_down_box wbot1 box1)
   deleted: (carrying_box wbot1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   goals met: 0 of 5
7. (deliver_supply wbot1 box1 anesthetic neurology_ward neurology_unit)
   deleted: (supply_in_box anesthetic box1) (needs_supply neurology_unit anesthetic)
   added: (box_is_empty box1) (has_supply neurology_unit anesthetic)
   goals met: 1 of 5
8. (pick_up_box wbot1 box1 neurology_ward)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box wbot1 box1)
   goals met: 1 of 5
9. (move_worker_bot_with_box wbot1 box1 neurology_ward diagnostic_lab)
   deleted: (at wbot1 neurology_ward) (at box1 neurology_ward)
   added: (at wbot1 diagnostic_lab) (at box1 diagnostic_lab)
   goals met: 1 of 5
10. (move_worker_bot_with_box wbot1 box1 diagnostic_lab corridor1)
   deleted: (at wbot1 diagnostic_lab) (at box1 diagnostic_lab)
   added: (at wbot1 corridor1) (at box1 corridor1)
   goals met: 1 of 5
11. (move_worker_bot_with_box wbot1 box1 corridor1 central_warehouse)
   deleted: (at wbot1 corridor1) (at box1 corridor1)
   added: (at wbot1 central_warehouse) (at box1 central_warehouse)
   goals met: 1 of 5
12. (drop_down_box wbot1 box1)
   deleted: (carrying_box wbot1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   goals met: 1 of 5
13. (fill_box wbot1 box1 defibrillator central_warehouse)
   deleted: (box_is_empty box1)
   added: (supply_in_box defibrillator box1)
   goals met: 1 of 5
14. (pick_up_box wbot1 box1 central_warehouse)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box wbot1 box1)
   goals met: 1 of 5
15. (move_worker_bot_with_box wbot1 box1 central_warehouse corridor1)
   deleted: (at wbot1 central_warehouse) (at box1 central_warehouse)
   added: (at wbot1 corridor1) (at box1 corridor1)
   goals met: 1 of 5
16. (move_worker_bot_with_box wbot1 box1 corridor1 reception)
   deleted: (at wbot1 corridor1) (at box1 corridor1)
   added: (at wbot1 reception) (at box1 reception)
   goals met: 1 of 5
17. (move_worker_bot_with_box wbot1 box1 reception emergency_room)
   deleted: (at wbot1 reception) (at box1 reception)
   added: (at wbot1 emergency_room) (at box1 emergency_room)
   goals met: 1 of 5
18. (drop_down_box wbot1 box1)
   deleted: (carrying_box wbot1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   goals met: 1 of 5
19. (deliver_supply wbot1 box1 defibrillator emergency_room resuscitation_unit)
   deleted: (supply_in_box defibrillator box1) (needs_supply resuscitation_unit defibrillator)
   added: (box_is_empty box1) (has_supply resuscitation_unit defibrillator)
   goals met: 2 of 5
20. (pick_up_box wbot1 box1 emergency_room)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box wbot1 box1)
   goals met: 2 of 5
21. (move_worker_bot_with_box wbot1 box1 emergency_room reception)
   deleted: (at wbot1 emergency_room) (at box1 emergency_room)
   added: (at wbot1 reception) (at box1 reception)
   goals met: 2 of 5
22. (move_worker_bot_with_box wbot1 box1 reception corridor1)
   deleted: (at wbot1 reception) (at box1 reception)
   added: (at wbot1 corridor1) (at box1 corridor1)
   goals met: 2 of 5
23. (move_worker_bot_with_box wbot1 box1 corridor1 central_warehouse)
   deleted: (at wbot1 corridor1) (at box1 corridor1)
   added: (at wbot1 central_warehouse) (at box1 central_warehouse)
   goals met: 2 of 5
24. (drop_down_box wbot1 box1)
   deleted: (carrying_box wbot1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   goals met: 2 of 5
25. (fill_box wbot1 box1 scalpel central_warehouse)
   deleted: (box_is_empty box1)
   added: (supply_in_box scalpel box1)
   goals met: 2 of 5
26. (pick_up_box wbot1 box1 central_warehouse)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box wbot1 box1)
   goals met: 2 of 5
27. (move_worker_bot_with_box wbot1 box1 central_warehouse corridor1)
   deleted: (at wbot1 central_warehouse) (at box1 central_warehouse)
   added: (at wbot1 corridor1) (at box1 corridor1)
   goals met: 2 of 5
28. (move_worker_bot_with_box wbot1 box1 corridor1 reception)
   deleted: (at wbot1 corridor1) (at box1 corridor1)
   added: (at wbot1 reception) (at box1 reception)
   goals met: 2 of 5
29. (move_worker_bot_with_box wbot1 box1 reception emergency_room)
   deleted: (at wbot1 reception) (at box1 reception)
   added: (at wbot1 emergency_room) (at box1 emergency_room)
   goals met: 2 of 5
30. (drop_down_box wbot1 box1)
   deleted: (carrying_box wbot1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   goals met: 2 of 5
31. (deliver_supply wbot1 box1 scalpel emergency_room trauma_unit)
   deleted: (supply_in_box scalpel box1) (needs_supply trauma_unit scalpel)
   added: (box_is_empty box1) (has_supply trauma_unit scalpel)
   goals met: 3 of 5
32. (pick_up_patient hbot1 patient1 entrance)
   deleted: (patient_on_ground patient1) (bot_is_free hbot1)
   added: (helping_patient hbot1 patient1)
   goals met: 3 of 5
33. (move_helper_bot_with_patient hbot1 patient1 entrance reception)
   deleted: (at hbot1 entrance) (at patient1 entrance)
   added: (at hbot1 reception) (at patient1 reception)
   goals met: 3 of 5
34. (move_helper_bot_with_patient hbot1 patient1 reception corridor1)
   deleted: (at hbot1 reception) (at patient1 reception)
   added: (at hbot1 corridor1) (at patient1 corridor1)
   goals met: 3 of 5
35. (move_helper_bot_with_patient hbot1 patient1 corridor1 surgical_block)
   deleted: (at hbot1 corridor1) (at patient1 corridor1)
   added: (at hbot1 surgical_block) (at patient1 surgical_block)
   goals met: 3 of 5
36. (drop_down_patient hbot1 patient1)
   deleted: (helping_patient hbot1 patient1)
   added: (patient_on_ground patient1) (bot_is_free hbot1)
   goals met: 3 of 5
37. (deliver_patient hbot1 patient1 operation_unit surgical_block)
   deleted: (needs_patient operation_unit patient1)
   added: (has_patient operation_unit patient1)
   goals met: 4 of 5
38. (move_bot_alone hbot1 surgical_block corridor1)
   deleted: (at hbot1 surgical_block)
   added: (at hbot1 corridor1)
   goals met: 4 of 5
39. (move_bot_alone hbot1 corridor1 reception)
   deleted: (at hbot1 corridor1)
   added: (at hbot1 reception)
   goals met: 4 of 5
40. (move_bot_alone hbot1 reception entrance)
   deleted: (at hbot1 reception)
   added: (at hbot1 entrance)
   goals met: 4 of 5
41. (pick_up_patient hbot1 patient2 entrance)
   deleted: (patient_on_ground patient2) (bot_is_free hbot1)
   added: (helping_patient hbot1 patient2)
   goals met: 4 of 5
42. (move_helper_bot_with_patient hbot1 patient2 entrance reception)
   deleted: (at hbot1 entrance) (at patient2 entrance)
   added: (at hbot1 reception) (at patient2 reception)
   goals met: 4 of 5
43. (move_helper_bot_with_patient hbot1 patient2 reception corridor1)
   deleted: (at hbot1 reception) (at patient2 reception)
   added: (at hbot1 corridor1) (at patient2 corridor1)
   goals met: 4 of 5
44. (move_helper_bot_with_patient hbot1 patient2 corridor1 surgical_block)
   deleted: (at hbot1 corridor1) (at patient2 corridor1)
   added: (at hbot1 surgical_block) (at patient2 surgical_block)
   goals met: 4 of 5
45. (move_helper_bot_with_patient hbot1 patient2 surgical_block cardiology_ward)
   deleted: (at hbot1 surgical_block) (at patient2 surgical_block)
   added: (at hbot1 cardiology_ward) (at patient2 cardiology_ward)
   goals met: 4 of 5
46. (drop_down_patient hbot1 patient2)
   deleted: (helping_patient hbot1 patient2)
   added: (patient_on_ground patient2) (bot_is_free hbot1)
   goals met: 4 of 5
47. (deliver_patient hbot1 patient2 cardiology_unit cardiology_ward)
   deleted: (needs_patient cardiology_unit patient2)
   added: (has_patient cardiology_unit patient2)
   goals met: 5 of 5
